app/controllers/problems_controller.rb

SELECT "problems".* FROM "problems"
---
  def index
    @problems = Problem.all

SELECT "problems".* FROM "problems" WHERE "problems"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @problem = Problem.find(params[:id])

SELECT "problems".* FROM "problems" WHERE "problems"."id" = $1 LIMIT 1  [["id", "11"]]
---
  def edit
    @problem = Problem.find(params[:id])

INSERT INTO "problems" ("choice_id", "created_at", "description", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["choice_id", nil], ["created_at", Wed, 15 Aug 2012 23:22:57 UTC +00:00], ["description", "What job should I choose?"], ["updated_at", Wed, 15 Aug 2012 23:22:57 UTC +00:00], ["user_id", nil]]
---
  def create
    @problem = Problem.new(params[:problem])
    if @problem.save

SELECT "problems".* FROM "problems" WHERE "problems"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "problems" WHERE "problems"."id" = $1  [["id", 1]]
---
  def destroy
    @problem = Problem.find(params[:id])
    @problem.destroy